CSI API ETABS v1
cAreaObj.GetCurvedEdges Method
 Retrieves curve data for all edges of an area object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCurvedEdges(
	string Name,
	ref int NumEdges,
	ref int[] CurveType,
	ref double[] Tension,
	ref int[] NumPoints,
	ref double[] gx,
	ref double[] gy,
	ref double[] gz
)
Function GetCurvedEdges (
	Name As String,
	ByRef NumEdges As Integer,
	ByRef CurveType As Integer(),
	ByRef Tension As Double(),
	ByRef NumPoints As Integer(),
	ByRef gx As Double(),
	ByRef gy As Double(),
	ByRef gz As Double()
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumEdges As Integer
Dim CurveType As Integer()
Dim Tension As Double()
Dim NumPoints As Integer()
Dim gx As Double()
Dim gy As Double()
Dim gz As Double()
Dim returnValue As Integer
returnValue = instance.GetCurvedEdges(Name,
	NumEdges, CurveType, Tension, NumPoints,
	gx, gy, gz)
int GetCurvedEdges(
	String^ Name,
	int% NumEdges,
	array<int>^% CurveType,
	array<double>^% Tension,
	array<int>^% NumPoints,
	array<double>^% gx,
	array<double>^% gy,
	array<double>^% gz
)
abstract GetCurvedEdges :
        Name : string *
        NumEdges : int byref *
        CurveType : int[] byref *
        Tension : float[] byref *
        NumPoints : int[] byref *
        gx : float[] byref *
        gy : float[] byref *
        gz : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing area object with curved edges
NumEdges
Type: System.Int32
 The number of edges of the area object
CurveType
Type: System.Int32[]
 This is an array of size NumEdges. Contains the curve type for each edge, an integer from the following list:
Straight = 0
Circular Curve = 1
Multilinear Curve = 2
Bezier Curve = 3
Spline Curve = 4
Tension
Type: System.Double[]
 This is an array of size NumEdges. Used for spline, a value that specifies the amount that the curve bends between control points. Values greater than 1 produce unpredictable results
NumPoints
Type: System.Int32[]
 This is an array of size NumEdges. The number of points along the curve for each edge
gx
Type: System.Double[]
 This array has a size equal to the sum of all the items in the NumPoints array. Contains the global x coordinates Use the values in the NumPoints array to keep track of which points apply to which curve.
gy
Type: System.Double[]
 This array has a size equal to the sum of all the items in the NumPoints array. Contains the global y coordinates Use the values in the NumPoints array to keep track of which points apply to which curve.
gz
Type: System.Double[]
 This array has a size equal to the sum of all the items in the NumPoints array. Contains the global z coordinates Use the values in the NumPoints array to keep track of which points apply to which curve.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns a nonzero value
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace